In [43]:
import pandas as pd
from io import StringIO

In [44]:
data = ('col1,col2,col3\n'
        'x,y,1\n'
        'a,b,2\n'
        'c,d,3\n')

In [45]:
type(data)

str

In [46]:
#in memory file formate object
StringIO(data)

In [47]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [48]:
pd.read_csv(StringIO(data),usecols=('col1' , 'col2'))

  col1 col2
0    x    y
1    a    b
2    c    d

In [69]:
df=pd.read_csv('mixed_data_500_rows_no_headers.csv')
df.head()

,Unnamed: 0,1,Priya Malik,34,Male,HR,63503,2020-03-02,False
0,0,2,Ravi Shah,51,Female,Sales,46222,2023-05-26,False
1,1,3,Anjali Kumar,31,Male,Marketing,34073,2015-05-02,True
2,2,4,Neha Mehta,40,Female,HR,33935,2019-12-25,False
3,3,5,Pooja Singh,30,Male,HR,42709,2020-01-06,False
4,4,6,Ravi Singh,47,Female,Marketing,40533,2019-05-15,True

In [70]:
df.to_csv('mixed_data_500_rows_no_headers.csv',index=False)

In [71]:
# datatype in csv
data = ('x,y,z,r\n'
             '3,6,7,9\n'
             '7,7,8,9\n'
             '6,8,4')

In [72]:
df=pd.read_csv(StringIO(data))

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       3 non-null      int64
 1   y       3 non-null      int64
 2   z       3 non-null      int64
 3   r       2 non-null      float64
dtypes: float64(1), int64(3)
memory usage: 228.0 bytes

In [74]:
df=pd.read_csv(StringIO(data),dtype='object')

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       3 non-null      object
 1   y       3 non-null      object
 2   z       3 non-null      object
 3   r       2 non-null      object
dtypes: object(4)
memory usage: 228.0+ bytes

In [76]:
df.head()

   x  y  z    r
0  3  6  7    9
1  7  7  8    9
2  6  8  4  NaN

In [77]:
df.isnull().sum()

x    0
y    0
z    0
r    1
dtype: int64

In [79]:
df['x'][0] # jo value lene ho use likh sakte h jaise maine yaha sa first lii h

'3'

In [80]:
data = ('x,y,z,r\n'
             '3,6,7,9\n'
             '7,7,8,9\n'
             '6,8,4')

In [82]:
df=pd.read_csv(StringIO(data),dtype={'x':int,'y':float,'z':int})

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       3 non-null      int64
 1   y       3 non-null      float64
 2   z       3 non-null      int64
 3   r       2 non-null      float64
dtypes: float64(2), int64(2)
memory usage: 228.0 bytes

In [86]:
df.dtypes #datatype ka type batata h

x      int64
y    float64
z      int64
r    float64
dtype: object

In [88]:
data = ('col1,col2,col3\n'
        'x,y,1\n'
        'a,b,2\n'
        'c,d,3\n')

In [96]:
pd.read_csv(StringIO(data),index_col=0)

     col2  col3
col1
x       y     1
a       b     2
c       d     3